// Написать программу вычисления значения функции y = f(a).

Console.WriteLine("Я хз");
